M = 3.1095 * 1e-2  # 冰的质量
T1 = -4 # 冰的初始温度
c_ice = 1.80 * 1e3 # 单位：J/(kg K) 冰的比热容
T0 = 0 # 单位：摄氏度 冰的熔点

m = 1.36205 * 1e-1 # 水的质量
T2 = 41.2 # 单位：摄氏度 未修正的水的初始温度
c0 = 4.18 * 1e3 # 单位：J/(kg K) 水的比热容

T3 = 20.6  # 冰熔解为水后的平衡温度
 # 温度计的热容;1.9*1e6 是1m^3 玻璃和水银的热容
 # 温度计浸入液体的体积

m_s = 0.125985 # 量热器的内筒的质量
c_s = 0.389 * 1e3 # 单位：J/(kg K) 量热器的内筒和搅拌器的比热容

L = (m * c0 + m_s * c_s) * (T2 - T3) / M - c0 * (T3 - T0) - 1.80 * (T0 - T1)

print(L)

T2_p = 41.043829
T3_p = 20.361988

L_p = (m * c0 + m_s * c_s) * (T2_p - T3_p) / M - c0 * (T3_p - T0) - 1.80 * (T0 - T1)

print(L_p)


